## Staging: cloudfront
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 19 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                             NAME                                             |
|--------|----------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.url_shortener_certificate`                                              |
|        | `aws_acm_certificate_validation.url_shortener_certificate_validation`                        |
|        | `aws_cloudfront_distribution.url_shortener_api`                                              |
|        | `aws_cloudfront_response_headers_policy.security_headers_api`                                |
|        | `aws_route53_record.url_shortener_A`                                                         |
|        | `aws_route53_record.url_shortener_dns_validation[&quot;*.url-shortener.cdssandbox.xyz&quot;]`          |
|        | `aws_route53_record.url_shortener_dns_validation[&quot;url-shortener.cdssandbox.xyz&quot;]`            |
|        | `aws_wafv2_regex_pattern_set.valid_uri_paths`                                                |
|        | `aws_wafv2_web_acl.api_waf`                                                                  |
|        | `module.resolver_dns.aws_cloudwatch_log_group.route53_vpc_dns`                               |
|        | `module.resolver_dns.aws_cloudwatch_log_resource_policy.route53_vpc_dns`                     |
|        | `module.resolver_dns.aws_route53_resolver_firewall_domain_list.allowed[0]`                   |
|        | `module.resolver_dns.aws_route53_resolver_firewall_domain_list.blocked[0]`                   |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule.allowed[0]`                          |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule.blocked[0]`                          |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule_group.firewall_rules[0]`             |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]` |
|        | `module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns`                  |
|        | `module.resolver_dns.aws_route53_resolver_query_log_config_association.route53_vpc_dns`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.url_shortener_certificate will be created
  + resource "aws_acm_certificate" "url_shortener_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "url-shortener.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.url-shortener.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "url-shortener.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.url-shortener.cdssandbox.xyz",
          + "url-shortener.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.url_shortener_certificate_validation will be created
  + resource "aws_acm_certificate_validation" "url_shortener_certificate_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.url_shortener_api will be created
  + resource "aws_cloudfront_distribution" "url_shortener_api" {
      + aliases                        = [
          + "url-shortener.cdssandbox.xyz",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true
      + web_acl_id                     = (known after apply)

      + default_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = 86400
          + max_ttl                    = 31536000
          + min_ttl                    = 1
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "url-shortener-api"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"
        }

      + ordered_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = 0
          + max_ttl                    = 0
          + min_ttl                    = 0
          + path_pattern               = "/healthcheck"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "url-shortener-api"
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "api.url_shortener_url.com"
          + origin_id           = "url-shortener-api"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 60
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_api will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_api" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "url-shortener-security-headers-api"

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "report-uri https://csp-report-to.security.cdssandbox.xyz/report; default-src 'none'; script-src 'self'; connect-src 'self'; img-src 'self'; style-src 'self'; frame-ancestors 'self'; form-action 'self';"
              + override                = false
            }

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }

          + referrer_policy {
              + override        = true
              + referrer_policy = "same-origin"
            }

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_route53_record.url_shortener_A will be created
  + resource "aws_route53_record" "url_shortener_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "url-shortener.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z00486671I4SMQMHD8PKB"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.url_shortener_dns_validation["*.url-shortener.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "url_shortener_dns_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z00486671I4SMQMHD8PKB"
    }

  # aws_route53_record.url_shortener_dns_validation["url-shortener.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "url_shortener_dns_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z00486671I4SMQMHD8PKB"
    }

  # aws_wafv2_regex_pattern_set.valid_uri_paths will be created
  + resource "aws_wafv2_regex_pattern_set" "valid_uri_paths" {
      + arn         = (known after apply)
      + description = "Regex to match the valid paths of hte API"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "valid-api-paths"
      + scope       = "CLOUDFRONT"
      + tags        = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }

      + regular_expression {
          + regex_string = "^/(version|openapi.json|.well-known/security.txt)$"
        }
      + regular_expression {
          + regex_string = "^/[0-9A-Za-z+/=]{8}$"
        }
      + regular_expression {
          + regex_string = "^/v1$"
        }
    }

  # aws_wafv2_web_acl.api_waf will be created
  + resource "aws_wafv2_web_acl" "api_waf" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "WAF for URL shortener API"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "url-shortener-waf"
      + scope       = "CLOUDFRONT"
      + tags        = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "APIInvalidPath"
          + priority = 1

          + action {

              + block {
                }
            }

          + statement {

              + not_statement {
                  + statement {

                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {

                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "APIInvalidPaths"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "APIRateLimit"
          + priority = 20

          + action {

              + block {
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 2000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "APIRateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 30

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 40

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 50

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "api"
          + sampled_requests_enabled   = false
        }
    }

  # module.resolver_dns.data.aws_iam_policy_document.route53_resolver_logging_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "route53_resolver_logging_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "route53.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.resolver_dns.aws_cloudwatch_log_group.route53_vpc_dns will be created
  + resource "aws_cloudwatch_log_group" "route53_vpc_dns" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/route53/vpc-0801eefa3b72cc1da"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_cloudwatch_log_resource_policy.route53_vpc_dns will be created
  + resource "aws_cloudwatch_log_resource_policy" "route53_vpc_dns" {
      + id              = (known after apply)
      + policy_document = (known after apply)
      + policy_name     = "route53_resolver_logging_policy"
    }

  # module.resolver_dns.aws_route53_resolver_firewall_domain_list.allowed[0] will be created
  + resource "aws_route53_resolver_firewall_domain_list" "allowed" {
      + arn      = (known after apply)
      + domains  = [
          + "*.amazonaws.com.",
          + "*.canada.ca.",
          + "*.gc.ca.",
        ]
      + id       = (known after apply)
      + name     = "AllowedDomains"
      + tags     = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_domain_list.blocked[0] will be created
  + resource "aws_route53_resolver_firewall_domain_list" "blocked" {
      + arn      = (known after apply)
      + domains  = [
          + "*.",
        ]
      + id       = (known after apply)
      + name     = "BlockedDomains"
      + tags     = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule.allowed[0] will be created
  + resource "aws_route53_resolver_firewall_rule" "allowed" {
      + action                  = "ALLOW"
      + firewall_domain_list_id = (known after apply)
      + firewall_rule_group_id  = (known after apply)
      + id                      = (known after apply)
      + name                    = "AllowedDomains"
      + priority                = 100
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule.blocked[0] will be created
  + resource "aws_route53_resolver_firewall_rule" "blocked" {
      + action                  = "BLOCK"
      + block_response          = "NODATA"
      + firewall_domain_list_id = (known after apply)
      + firewall_rule_group_id  = (known after apply)
      + id                      = (known after apply)
      + name                    = "BlockedDomains"
      + priority                = 200
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule_group.firewall_rules[0] will be created
  + resource "aws_route53_resolver_firewall_rule_group" "firewall_rules" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "FirewallRules"
      + owner_id     = (known after apply)
      + share_status = (known after apply)
      + tags         = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0] will be created
  + resource "aws_route53_resolver_firewall_rule_group_association" "firewall_rules" {
      + arn                    = (known after apply)
      + firewall_rule_group_id = (known after apply)
      + id                     = (known after apply)
      + mutation_protection    = (known after apply)
      + name                   = "FirewallRules"
      + priority               = 101
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0801eefa3b72cc1da"
    }

  # module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns will be created
  + resource "aws_route53_resolver_query_log_config" "route53_vpc_dns" {
      + arn             = (known after apply)
      + destination_arn = (known after apply)
      + id              = (known after apply)
      + name            = "route53_vpc_dns"
      + owner_id        = (known after apply)
      + share_status    = (known after apply)
      + tags_all        = (known after apply)
    }

  # module.resolver_dns.aws_route53_resolver_query_log_config_association.route53_vpc_dns will be created
  + resource "aws_route53_resolver_query_log_config_association" "route53_vpc_dns" {
      + id                           = (known after apply)
      + resolver_query_log_config_id = (known after apply)
      + resource_id                  = "vpc-0801eefa3b72cc1da"
    }

Plan: 19 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
